# GetLinkedFileStatus Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExternalFileReference..::..GetLinkedFileStatus Method
ExternalFileReference Class See Also
---
Returns a LinkedFileStatus.Enum corresponding to the load status of the referenced file.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public LinkedFileStatus GetLinkedFileStatus()
```

Visual Basic
---
```text
Public Function GetLinkedFileStatus As LinkedFileStatus
```

Visual C++
---
```text
public:
LinkedFileStatus GetLinkedFileStatus()
```

# Remarks
Options are Invalid, Loaded, Unloaded, NotFound, or Imported.
# See Also
ExternalFileReference Class
Autodesk.Revit.DB Namespace